/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_printf.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: nayokota <nayokota@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/11/16 14:33:32 by nayokota          #+#    #+#             */
/*   Updated: 2025/11/16 18:48:55 by nayokota         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf"		

int	printf(const char *restrictformat, ...)
{
	
}


// %毎に分割

// %の数分配列を進める
// どの処理を割り当てるか判断
// 割り当てた処理を実行
// 配列にぶち込む

// 出力

